# Global consumer electronic brand sales analysis

## Importing libraries and data

During this step, we import the necessary libraries and load the data required for further analysis.

In [3]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, MetaData, Table, ForeignKey
from sqlalchemy import Column, Integer, String, inspect, Float, Date, join, select
import os
import plotly.graph_objs as go 
from plotly.offline import init_notebook_mode,iplot
import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.ticker import FuncFormatter
init_notebook_mode(connected=True)

In [4]:
customers = pd.read_csv('data/Customers.csv', encoding='ISO-8859-1')
exchange_rates = pd.read_csv('data/Exchange_Rates.csv', encoding='ISO-8859-1')
products = pd.read_csv('data/Products.csv', encoding='ISO-8859-1')
sales = pd.read_csv('data/Sales.csv', encoding='ISO-8859-1')
stores = pd.read_csv('data/Stores.csv', encoding='ISO-8859-1')

## Assigning correct datatypes to variables

In this step, we will assign the appropriate data types to the DataFrame columns to ensure optimal performance, memory usage, and accurate analysis.
This version emphasizes the purpose of assigning correct data types and includes the benefits like performance, memory optimization, and data accuracy.

In [5]:
customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [6]:
customers['Gender'] = customers['Gender'].astype('category')
customers['Birthday'] = customers['Birthday'].astype('datetime64[ns]')

In [7]:
exchange_rates.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [8]:
exchange_rates['Date'] = exchange_rates['Date'].astype('datetime64[ns]')
exchange_rates['Currency'] = exchange_rates['Currency'].astype('category')

In [9]:
products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [10]:
products['Unit Price USD'] = products['Unit Price USD'].replace('[\$,]', '', regex=True).astype('float64')

In [11]:
sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [12]:
sales['Order Date'] = sales['Order Date'].astype('datetime64[ns]')
sales['Delivery Date'] = sales['Delivery Date'].astype('datetime64[ns]')

In [13]:
stores.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [14]:
stores['Open Date'] = stores['Open Date'].astype('datetime64[ns]')

## Data Cleaning

This step examines the shape of the datasets and identifies any irregularities or anomalies in the data.

### Exploring the shape of the datasets

In [15]:
customers.shape

(15266, 10)

In [16]:
exchange_rates.shape

(11215, 3)

In [17]:
products.shape

(2517, 10)

In [18]:
sales.shape

(62884, 9)

In [19]:
stores.shape

(67, 5)

The datasets have varying shapes, with the stores dataset being the smallest in terms of observations, while the sales dataset contains the most observations.

### Exploring the number of missing values in each dataset

In [20]:
(customers.isnull().sum(axis=1) > 0).sum()

np.int64(10)

In [21]:
(exchange_rates.isnull().sum(axis=1) > 0).sum()

np.int64(0)

In [22]:
(products.isnull().sum(axis=1) > 0).sum()

np.int64(0)

In [23]:
(sales.isnull().sum(axis=1) > 0).sum()

np.int64(49719)

In [24]:
(stores.isnull().sum(axis=1) > 0).sum()

np.int64(1)

The number of rows with missing values is insignificant in most datasets and can be safely dropped. However, in the sales dataset, out of 63,000 rows, almost 50,000 contain missing values, which makes dropping rows impractical. A better approach would be to identify which variables (columns) in the sales dataset contain the most missing values and decide how to handle them, such as by imputing missing values or analyzing why they are missing.

### Dealing with missing values

In [25]:
customers.dropna(inplace=True)

In [26]:
stores.dropna(inplace=True)

In [27]:
missing_values = sales.isnull().sum()

In [28]:
missing_values

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

The sales dataset contains missing values exclusively in the Delivery Date column, where the dates weren't recorded properly. A potential solution to fill these missing values is to calculate the average delivery time in days and use this value to estimate the missing Delivery Dates by adding the calculated number of days to the corresponding Order Date. This approach will allow for reasonable estimations of the missing Delivery Dates, enabling us to fill in the missing data with a method grounded in the dataset's historical patterns.

In [29]:
average_delivery_time = (sales[-sales['Delivery Date'].isnull()]['Delivery Date'] - sales[-sales['Delivery Date'].isnull()]['Order Date']).mean()

In [30]:
sales.loc[sales['Delivery Date'].isnull(), 'Delivery Date'] = sales.loc[sales['Delivery Date'].isnull(), 'Order Date'] + average_delivery_time

## Setting up SQLite database

Setting up the SQLite database and loading the required data for efficient access.

In [31]:
engine = create_engine("sqlite:///database/my_database.db")
metadata = MetaData()
metadata.bind = engine

In [32]:
# Upload the DataFrames to the SQLite database
customers.to_sql('customers', engine, if_exists='replace', index=False)
exchange_rates.to_sql('exchange_rates', engine, if_exists='replace', index=False)
products.to_sql('products', engine, if_exists='replace', index=False)
sales.to_sql('sales', engine, if_exists='replace', index=False)
stores.to_sql('stores', engine, if_exists='replace', index=False)

66

In [34]:
customers.to_csv('clean_data/customers.csv')
exchange_rates.to_csv('clean_data/exchange_rates.csv')
products.to_csv('clean_data/products.csv')
sales.to_csv('clean_data/sales.csv')
stores.to_csv('clean_data/stores.csv')

In [35]:
customers

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,1936-03-25
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,1965-08-18

In [36]:
sales

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,2016-01-05 12:41:56.855298139,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13 00:00:00.000000000,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13 00:00:00.000000000,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12 00:00:00.000000000,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12 00:00:00.000000000,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,2021-02-24 12:41:56.855298139,1216913,43,632,3,USD
62880,2243031,1,2021-02-20,2021-02-24 00:00:00.000000000,511229,0,98,4,EUR
62881,2243032,1,2021-02-20,2021-02-23 00:00:00.000000000,331277,0,1613,2,CAD
62882,2243032,2,2021-02-20,2021-02-23 00:00:00.000000000,331277,0,1717,2,CAD
62883,2243032,3,2021-02-20,2021-02-23 00:00:00.000000000,331277,0,464,7,CAD